[web][Re-MadCamp][MAMAGO]/mamago-api/app/controllers/concerns/authenticatable.rb

  def current_user
    if request.headers['access-token']
      @current_user ||= User.find_by(access_token: request.headers['access-token'])
---
SELECT "users".* FROM "users" WHERE "users"."access_token" = $1 LIMIT $2  [["access_token", "qOeXD2nSkTjBRmPVklb_bg"], ["LIMIT", 1]]