[web][Re-MadCamp][MAMAGO]/mamago-api/app/services/dialog_service.rb

  def self.create_dialog(target:, source:, user:)
    question = Question.all.sample
    dialog = Dialog.create!(user: user, target: target, source: source, question: question)
---
SELECT "questions".* FROM "questions"
INSERT INTO "dialogs" ("target", "user_id", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["target", 0], ["user_id", 1], ["question_id", 1], ["created_at", "2020-02-14 06:08:34.669176"], ["updated_at", "2020-02-14 06:08:34.669176"]]

  def self.update_dialog(dialog, original: nil, feedback: nil, user_intention: nil, complete: nil)
    source = dialog.source # ko
    target = dialog.target # en -> 사용자의 입력 언어

    update_params =
      # 사용자의 입력을 받아 번역과 예상 의도를 업데이트
      if original.present?
        comprehended = DialogService.translate(source: source, target: target, text: original)
        translated = DialogService.translate(source: target, target: source, text: comprehended)
        { original: original, comprehended: comprehended, translated: translated }

      # 사용자의 피드백을 받아 저장
      elsif !feedback.nil?
        if ActiveModel::Type::Boolean.new.cast(feedback).in? [true, false]
          { feedback: ActiveModel::Type::Boolean.new.cast(feedback) }
        end
      # 사용자의 의도를 받아 최종 번역
      elsif user_intention.present?
        user_intention_translated = DialogService.translate(source: source, target: target, text: user_intention)
        { user_intention: user_intention, user_intention_translated: user_intention_translated }

      # 끝났는지 확인
      elsif complete.in? [true, false]
        { complete: complete }
      end

    return dialog unless update_params.present? # parmas 가 주어지지 않으면 업데이트 안함

    dialog.update!(update_params).then do |success|
---
UPDATE "dialogs" SET "original" = $1, "translated" = $2, "comprehended" = $3, "updated_at" = $4 WHERE "dialogs"."id" = $5  [["original", "asdasd"], ["translated", "Asdasd."], ["comprehended", "Asdasd"], ["updated_at", "2020-02-14 06:41:54.196251"], ["id", 1]]