[web][Re-MadCamp][MAMAGO]/mamago-api/app/controllers/api/dialogs_controller.rb

    def create
      source = params[:source]
      target = params[:target]

      dialog = DialogService.create_dialog(target: target, source: source, user: current_user)
---
INSERT INTO "dialogs" ("target", "user_id", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["target", 0], ["user_id", 1], ["question_id", 1], ["created_at", "2020-02-14 06:12:40.631379"], ["updated_at", "2020-02-14 06:12:40.631379"]]

    def update
      @dialog = DialogService.update_dialog(
        @dialog,
        **dialog_params.as_json.transform_keys(&:to_sym)
      )
---
UPDATE "dialogs" SET "original" = $1, "translated" = $2, "comprehended" = $3, "updated_at" = $4 WHERE "dialogs"."id" = $5  [["original", "asdasd"], ["translated", "Asdasd."], ["comprehended", "Asdasd"], ["updated_at", "2020-02-14 06:41:54.196251"], ["id", 1]]

    def set_dialog
      @dialog = Dialog.find(params[:id])
---
SELECT "dialogs".* FROM "dialogs" WHERE "dialogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]