[web][Re-MadCamp][MAMAGO]/mamago-api/app/controllers/api/questions_controller.rb

SELECT "questions".* FROM "questions"
---
    def set_questions
      @questions = p Question.all