[web][Re-MadCamp][MAMAGO]/mamago-api/app/controllers/api/users_controller.rb

    def create
      user = User.create!(user_params)
---
INSERT INTO "users" ("email", "password_digest", "access_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def show
      user = User.find_by(access_token: request.headers['access-token'])

      raise ApplicationError, 'unvalid access_token' if user.empty?
---
SELECT 1 AS one FROM "users" WHERE "users"."access_token" IS NULL LIMIT $1  [["LIMIT", 1]]

    def login
      user = User.find_by(email: params[:email]).authenticate(params[:password])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@mamago.com"], ["LIMIT", 1]]