[web][Re-MadCamp][MAMAGO]/mamago-api/app/models/user.rb

  def generate_access_token
    begin
      self.access_token = SecureRandom.urlsafe_base64
    end while User.where(access_token: access_token).exists?
---
SELECT 1 AS one FROM "users" WHERE "users"."access_token" = $1 LIMIT $2  [["access_token", "qOeXD2nSkTjBRmPVklb_bg"], ["LIMIT", 1]]